{
    "main_title": "I-Grow Discipleship Guide",
    "study_topic": "Justice and Mercy in the Conquest (The Book of Joshua)",
    "context": "Context: Campus and Workplace Small Groups (Philippines)",
    "icebreaker_title": "The \"Fairness\" Debate",
    "icebreaker_text": "Think of a time when you were playing a game or working on a group project and someone \"cheated\" or didn't do their part but still got the same reward as you. How did that make you feel? Share your story in one minute or less.",
    "big_idea": "God's heart is always for restoration, and His judgments are not about anger, but about protecting life and providing a way back for everyone.",
    "passage_name": "Ezekiel 33",
    "key_verse": "As I live, says the Lord God, I have no pleasure in the death of the wicked, but that the wicked turn from his way and live",
    "verse_reference": "Ezekiel 33:11, ESV",
    "section1_title": "A Change of Heart",
    "section1_content": "God is often misunderstood as a strict judge waiting for us to mess up. However, Ezekiel 33:11 shows us a God who actually feels \"agony\" when people choose a path that leads to destruction. He is like a parent watching a child make a dangerous mistake, pleading for them to \"turn back\" before they get hurt. This means that my past mistakes do not define my future if I am willing to change direction today. When we turn to Him, His mercy overrides the consequences we originally deserved. This truth changes how I view my own failures because I realize God is cheering for my recovery rather than waiting for my punishment.",
    "section1_question": "Sa mga moments na feeling mo \"fail\" ka or lumayo ka kay Lord, how does knowing He takes \"no pleasure\" in your struggle change your perspective? (Does this make it easier for you to come back to Him?)",
    "section1_key_truth": "God is cheering for your recovery, not waiting for your punishment. Your past mistakes don't define your future when you turn to Him.",
    "section2_title": "Our Shared Responsibility",
    "section2_content": "In our communities, we often find it easy to judge others while excusing ourselves. Ezekiel reminds us that God is impartial, meaning He holds everyone to the same standard of love and justice. As a group, we are called to be like \"watchmen\" who look out for one another's spiritual well-being. This is not about being \"judgy,\" but about caring enough to speak up when we see a friend heading toward a \"dead end.\" Our relationships grow deeper when we create a space where it is safe to admit we are wrong and encourage each other to stay on the right path. We represent God's fairness by being consistent in how we treat people, regardless of their background or status.",
    "section2_question": "How can we make our group a \"safe space\" where it's okay to admit mistakes without feeling judged by others? (Ano yung isang thing na pwede nating gawin para mas maging supportive sa isa't isa?)",
    "section2_key_truth": "True community happens when we're consistent in how we treat everyone, creating space where it's safe to admit mistakes and grow together.",
    "section3_title": "A Mission of Mercy",
    "section3_content": "The story of the conquest in Joshua and the warnings in Ezekiel show that God intervenes only when evil begins to destroy everything good. Our mission today is to share the \"Good News\" that there is always a way out of toxic cycles and harmful lifestyles. Just as Rahab found safety in the middle of a city facing judgment, God is looking for \"outsiders\" to bring into His family. We are sent to our campuses and offices not to condemn people, but to offer them the same mercy we have received. When we live out this mission, we show the world that God's ultimate goal is not to \"win a war,\" but to save as many people as possible.",
    "section3_question": "Sino yung \"unlikely person\" sa workplace or school mo na feeling mo kailangan ng encouragement or mercy ngayon? (How can you show them God's kindness this week without sounding like you are lecturing them?)",
    "section3_key_truth": "God's ultimate goal isn't to \"win a war\" but to save as many people as possible. When we show mercy, we reveal His true heart.",
    "key_insight": "It is easy to look at the stories of judgment in the Bible and feel afraid or confused. But when we look closer at Ezekiel 33, we see a God who is actually \"longsuffering\" and incredibly patient. He waits until the very last second, hoping that just one more person will turn around and live. He does not want anyone to perish, and that includes you, your \"difficult\" boss, or your struggling classmate. This reveals that God is both perfectly just and incredibly kind at the same time. You can trust Him with the things you don't understand because His heart is always moved by love.",
    "action_step": "Identify one person this week who seems to be \"struggling with the consequences\" of a bad choice. Instead of joining in the gossip or judging them, offer them a genuine word of encouragement or a small act of kindness to remind them that there is always a path back to hope.",
    "struggles_list": "Felt like a failure\nMade a big mistake\nDrifted from prayer/Bible reading\nHurt someone I care about\nGave in to temptation\nDoubted God's goodness",
    "safespace_list": "Listen without interrupting\nNo gossip rule\nShare our own struggles first\nPray for each other regularly\nCheck in during the week\nCelebrate small wins together"
}